# We will first import the already installed pandas.  

### Pandas contains data sturctures and data manipulation tools designed to make data analysis fast and easy in python"....Wes Mckinney (creator of Pandas).  

#### a. First install using conda in the Anaconda prompt: conda install pandas or in this notebook with !pip install pandas  
#### b. import into the notebook which makes all the functions in it avaialble to use for use as: import pandas as pd (the pd is a pseudo name we are giving to pandas).  

# Outline  
#### 1. Introduction to pandas Data Structures: Series, DataFrame, Index Objects  
#### 2. Essential functions:  
   #### 2.1. Reindexing  
   #### 2.2 Dropping entries from an axis  
  #### 2.3 Indexing, Selection,and Filtering  
  #### 2.4 Integer indexes  
  #### 2.5 Arithmetic and data alignment  
  #### 2.6 Sorting and ranking  
  #### 2.7. Axis indexes and duplicate labels

In [4]:
# First things first: import pandas as pd
import pandas as pd #library()

In [5]:
# Pandas data structures:
from pandas import Series, DataFrame

## Series  
### Series: A one dimentional array object containing sequence of values and associated array of data lebels called index

In [74]:
obj = pd.Series([2, 4, 6, 8, 10])
print(obj)

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [76]:
print(obj.values)
print(obj.index)

[ 2  4  6  8 10]
RangeIndex(start=0, stop=5, step=1)

In [77]:
#creating your own index to accompany series values
obj2 = pd.Series([2, 4, 6, 8, 10], index = ["a", 'b', 'c', 'd', 'e'])
print(obj2)

a     2
b     4
c     6
d     8
e    10
dtype: int64

In [78]:
# we can also create series with dictionaries: dictionaries are key:value pairs
dict = {0: 2, 1:4, 2:6, 3:8, 4: -10}
obj3 = pd.Series(dict)
print(obj3)

0     2
1     4
2     6
3     8
4   -10
dtype: int64

In [83]:
# Indexes are ways of indentifying rows and are extremely useful for selecting rows
print(obj2['a'])
print(obj2[['a','e', 'c']])

2
a     2
e    10
c     6
dtype: int64

In [84]:
# we can change the indexes in place: lets change index of obj2 (a,b,c,d,e) to gh,ug,nig,uk,can
obj2.index = ['gh','ug', 'nig','uk', 'can']
print(obj2)

gh      2
ug      4
nig     6
uk      8
can    10
dtype: int64

In [15]:
#unless u explicitly change the index, their pairs with the values are for live. Ex when i scale the values in obj2 twice
print(obj2 *2)

gh      4
ug      8
nig    12
uk     16
can    20
dtype: int64

In [85]:
#dropping rows
obj2.drop(['uk', 'can'])

gh     2
ug     4
nig    6
dtype: int64

In [91]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\erica\anaconda3\envs\sql\lib\site-packages (1.3.2)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\erica\anaconda3\envs\sql\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.17.3 in c:\users\erica\anaconda3\envs\sql\lib\site-packages (from pandas) (1.20.3)
Requirement already satisfied: pytz>=2017.3 in c:\users\erica\anaconda3\envs\sql\lib\site-packages (from pandas) (2021.1)
Requirement already satisfied: six>=1.5 in c:\users\erica\anaconda3\envs\sql\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)

In [59]:
# selecting series
print(obj2[obj2>2])

ug      4
nig     6
uk      8
can    10
dtype: int64

In [ ]:
# filtering series

## Data Frame:  
###  It is a rectangular table of data and contains a row index and a column index

In [86]:
#we will use the dictionary method to create data frames
dict2 = {'regions': ['accra', 'ash', 'eastern', 'volta'],
        'population': [2000000, 1500000,1000000, 800000],
        'minister': ['samson', 'patrick', 'aba', 'seth']  
       }
data = pd.DataFrame(dict2)   
print(data)

   regions  population minister
0    accra     2000000   samson
1      ash     1500000  patrick
2  eastern     1000000      aba
3    volta      800000     seth

In [87]:
#we can create the dataframe together with an index we so which (instead of 0,1,2,3) like
data2 = pd.DataFrame(data, columns = ['regions', 'minister', 'population'])
data2

   regions minister  population
0    accra   samson     2000000
1      ash  patrick     1500000
2  eastern      aba     1000000
3    volta     seth      800000

In [88]:
#we can  use a column as an index:
data3 = data2.set_index('regions')
print(data3)

        minister  population
regions
accra     samson     2000000
ash      patrick     1500000
eastern      aba     1000000
volta       seth      800000

In [90]:
#some key methods on data frames
print(data2.shape)
print(data2.head(n=2))
print(data2.columns)
print(data2.index)

(4, 3)
  regions minister  population
0   accra   samson     2000000
1     ash  patrick     1500000
Index(['regions', 'minister', 'population'], dtype='object')
RangeIndex(start=0, stop=4, step=1)

In [111]:
# assigning new columns
data3['food'] = ['kenkey', 'fufu', 'fufu', 'akple']
data3['popsq'] = data3['population'] *  data3['population'] 

print(data3)

        minister  population    food          popsq
regions
accra     samson     2000000  kenkey  4000000000000
ash      patrick     1500000    fufu  2250000000000
eastern      aba     1000000    fufu  1000000000000
volta       seth      800000   akple   640000000000

In [94]:
#dropping rows and columns
#.drop rows using the axis =0 label
data3.drop(['accra', 'ash'], axis = 0)

#drop columns using the axis =1 label
data3.drop(['minister', 'food'], axis = 1)

         population
regions
accra       2000000
ash         1500000
eastern     1000000
volta        800000

## Selections or subletting

In [96]:
# select columns
print(data2['population'])
print(data2[['population','minister']])

0    2000000
1    1500000
2    1000000
3     800000
Name: population, dtype: int64
   population minister
0     2000000   samson
1     1500000  patrick
2     1000000      aba
3      800000     seth

In [97]:
#column filtering
print(data[data['population'] >1000000])

  regions  population minister
0   accra     2000000   samson
1     ash     1500000  patrick

## Advanced rows and columns using loc (axis labels) or iloc(axis position)

In [66]:
print(data3)

         population minister    food
regions
accra       2000000   samson  kenkey
ash         1500000  patrick    fufu
eastern     1000000      aba    fufu
volta        800000     seth   akple

### iLoc (axis values)

In [99]:
#data3.iloc[rows_selection,  column_selection]
data3.iloc[0 , 2]

'kenkey'

In [101]:
data3.iloc[[0,3] , [2, 0]]

           food minister
regions
accra    kenkey   samson
volta     akple     seth

### Loc (axis labels)

In [102]:
#select one row and one column based on labels
data3.loc['accra', 'food']

'kenkey'

In [103]:
#select many rows and columns based on labels (loc)
data3.loc[['accra','volta'], ['food', 'population']]

           food  population
regions
accra    kenkey     2000000
volta     akple      800000

# Saving and importing data   

## Common and consistent ways to save common files   
a. nameofdataframe.to_json('adress)   eg. if you want to save data3 toa json format: data3.to_json('data3tojson.json')
b. .to_html()   
c. .to_sql()   
d. .to_pickle()  
f. namedf.to_csv("address")

## Common and consistent ways to read common files    
a.pandas.read_json(): eg   pandas.read_csv('data3tojson.json')
b. read_html()   
c. read_sql()   
d. read_pickle()

# Save and import a CSV file

In [123]:
# Save to csv
print(data3)

        minister  population    food          popsq
regions
accra     samson     2000000  kenkey  4000000000000
ash      patrick     1500000    fufu  2250000000000
eastern      aba     1000000    fufu  1000000000000
volta       seth      800000   akple   640000000000

In [124]:
data3.to_csv("ghanadata.csv") #write_csv()

In [128]:
newdata = pd.read_csv("ghanadata.csv")
print(newdata)

   regions minister  population    food          popsq
0    accra   samson     2000000  kenkey  4000000000000
1      ash  patrick     1500000    fufu  2250000000000
2  eastern      aba     1000000    fufu  1000000000000
3    volta     seth      800000   akple   640000000000

# Json files

In [129]:
import json

# Creating a Python Dictionary
data = {"Sub_ID":["1","2","3","4","5","6","7","8" ],
        "Name":["Erik", "Daniel", "Michael", "Sven",
                "Gary", "Carol","Lisa", "Elisabeth" ],
        "Salary":["723.3", "515.2", "621", "731", 
                  "844.15","558", "642.8", "732.5" ],
        "StartDate":[ "1/1/2011", "7/23/2013", "12/15/2011",
                     "6/11/2013", "3/27/2011","5/21/2012", 
                     "7/30/2013", "6/17/2014"],
        "Department":[ "IT", "Manegement", "IT", "HR", 
                      "Finance", "IT", "Manegement", "IT"],
        "Sex":[ "M", "M", "M", 
              "M", "M", "F", "F", "F"]}

print(data)

{'Sub_ID': ['1', '2', '3', '4', '5', '6', '7', '8'], 'Name': ['Erik', 'Daniel', 'Michael', 'Sven', 'Gary', 'Carol', 'Lisa', 'Elisabeth'], 'Salary': ['723.3', '515.2', '621', '731', '844.15', '558', '642.8', '732.5'], 'StartDate': ['1/1/2011', '7/23/2013', '12/15/2011', '6/11/2013', '3/27/2011', '5/21/2012', '7/30/2013', '6/17/2014'], 'Department': ['IT', 'Manegement', 'IT', 'HR', 'Finance', 'IT', 'Manegement', 'IT'], 'Sex': ['M', 'M', 'M', 'M', 'M', 'F', 'F', 'F']}

In [130]:
import json

# Parse JSON
with open('data.json', 'w') as outfile:
    json.dump(data, outfile)

In [131]:
dfjson = pd.read_json('data.json')

dfjson

   Sub_ID       Name  Salary   StartDate  Department Sex
0       1       Erik  723.30    1/1/2011          IT   M
1       2     Daniel  515.20   7/23/2013  Manegement   M
2       3    Michael  621.00  12/15/2011          IT   M
3       4       Sven  731.00   6/11/2013          HR   M
4       5       Gary  844.15   3/27/2011     Finance   M
5       6      Carol  558.00   5/21/2012          IT   F
6       7       Lisa  642.80   7/30/2013  Manegement   F
7       8  Elisabeth  732.50   6/17/2014          IT   F

In [133]:
dir(pd)

['BooleanDtype',
 'Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Flags',
 'Float32Dtype',
 'Float64Dtype',
 'Float64Index',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int64Index',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NA',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseDtype',
 'StringDtype',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt64Index',
 'UInt8Dtype',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__getattr__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_config',
 '_hashtable',
 '_is_numpy_dev',
 '_lib',
 '_libs',
 '_np_version_under1p18',
 '_testing',
 '_tslib',
 '_typing',
 '_version',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'json_normalize',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'read_xml',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

# Excel files  
## Key packages to install   
a. xlwt to write to .xls files   
b. openpyxl or XlsxWriter to write to .xlsx files   
c. xlrd to read Excel files

In [118]:
!pip install xlwt openpyxl xlsxwriter xlrd

Requirement already satisfied: xlwt in c:\users\erica\anaconda3\envs\sql\lib\site-packages (1.3.0)
Requirement already satisfied: openpyxl in c:\users\erica\anaconda3\envs\sql\lib\site-packages (3.0.8)
Requirement already satisfied: xlsxwriter in c:\users\erica\anaconda3\envs\sql\lib\site-packages (3.0.1)
Requirement already satisfied: xlrd in c:\users\erica\anaconda3\envs\sql\lib\site-packages (2.0.1)
Requirement already satisfied: et-xmlfile in c:\users\erica\anaconda3\envs\sql\lib\site-packages (from openpyxl) (1.1.0)

In [135]:
data3.to_excel('data3.xlsx')

# Introduction to Databases

# Databases: Containers for storing similar information  

![source:Broadcom Inc](bd.jpg)   

# Top Databases in the world   

![source: virtual studio magazine](topdb.png)   

# Relational Database
.
![source:clicData](relation.png)   

# Non-Relational Database   

![source:programmer](NoSQL.jpg)